app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
---
    def index
        activities = Activity.all

SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "chatrooms".* FROM "chatrooms"
---
    def show
        activity = Activity.find(params[:id])
        chatroom = Chatroom.all.find{ |c| c.activity_id == activity.id}