app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "activities".* FROM "activities"
---
    def show
        category = Category.find(params[:id])
        activities = Activity.all.select{ |a| a.category_id == category.id}