app/controllers/chatrooms_controller.rb

    def index
        chatrooms = Chatroom.all
---
SELECT "chatrooms".* FROM "chatrooms"

    def show
        chatroom = Chatroom.find(params[:id])
        messages = Message.all.select{ |m| m.chatroom_id == chatroom.id}
---
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages"