app/controllers/messages_controller.rb

    def index
        message = Message.all
---
SELECT "messages".* FROM "messages"