app/controllers/users_controller.rb

    def show
        user = User.find(params[:id])
        activities = Activity.all.select{ |a| a.user_id == user.id}
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "activities".* FROM "activities"